{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "<|endoftext|>": 5,
      "\"": 6,
      "#": 7,
      "%": 8,
      "(": 9,
      ")": 10,
      "+": 11,
      "-": 12,
      ".": 13,
      "/": 14,
      "0": 15,
      "1": 16,
      "2": 17,
      "3": 18,
      "4": 19,
      "5": 20,
      "6": 21,
      "7": 22,
      "8": 23,
      "9": 24,
      ":": 25,
      "<": 26,
      "=": 27,
      ">": 28,
      "@": 29,
      "A": 30,
      "B": 31,
      "C": 32,
      "D": 33,
      "E": 34,
      "F": 35,
      "G": 36,
      "H": 37,
      "I": 38,
      "K": 39,
      "L": 40,
      "M": 41,
      "N": 42,
      "O": 43,
      "P": 44,
      "R": 45,
      "S": 46,
      "T": 47,
      "U": 48,
      "V": 49,
      "W": 50,
      "X": 51,
      "Y": 52,
      "Z": 53,
      "[": 54,
      "\\": 55,
      "]": 56,
      "a": 57,
      "b": 58,
      "c": 59,
      "d": 60,
      "e": 61,
      "f": 62,
      "g": 63,
      "h": 64,
      "i": 65,
      "l": 66,
      "m": 67,
      "n": 68,
      "o": 69,
      "p": 70,
      "r": 71,
      "s": 72,
      "t": 73,
      "u": 74,
      "y": 75,
      "cc": 76,
      "CC": 77,
      "c1": 78,
      "(=": 79,
      ":\"": 80,
      ">>": 81,
      "ccc": 82,
      "OC": 83,
      "c2": 84,
      ")(": 85,
      "on": 86,
      "Re": 87,
      "Gr": 88,
      "ac": 89,
      "ion": 90,
      "ou": 91,
      "tion": 92,
      "Reac": 93,
      "Grou": 94,
      "Reaction": 95,
      "Group": 96,
      "](": 97,
      "c1cc": 98,
      "c1ccc": 99,
      "Cl": 100,
      ")[": 101,
      "CCCC": 102,
      "CO": 103,
      "cc1": 104,
      "NC": 105,
      "-]": 106,
      ".[": 107,
      "@@": 108,
      "C1": 109,
      "c1cccc": 110,
      "c3": 111,
      "c2cc": 112,
      "CCC": 113,
      "+]": 114,
      ")=": 115,
      "1C": 116,
      "ccc2": 117,
      "c1ccccc1": 118,
      "nc": 119,
      "COC": 120,
      "CN": 121,
      "CC1": 122,
      "(-": 123,
      "Br": 124,
      "CCN": 125,
      "n1": 126,
      "2C": 127,
      "c2ccccc2": 128,
      "c2ccc": 129,
      "cc2": 130,
      "CCO": 131,
      "([": 132,
      "CCOC": 133,
      "c1c": 134,
      ")(=": 135,
      "Si": 136,
      "c3cc": 137,
      "C2": 138,
      "nH": 139,
      "-])": 140,
      "Cc1ccc": 141,
      "=[": 142,
      "N1": 143,
      "ccc3": 144,
      "OCC": 145,
      "n2": 146,
      "CC2": 147,
      "CI": 148,
      "+]>>": 149,
      "-].[": 150,
      "c2c": 151,
      "c4": 152,
      "-]>>": 153,
      "+].[": 154,
      "+](=": 155,
      "COc1ccc": 156,
      "Na": 157,
      "c3ccccc3": 158,
      "cc3": 159,
      "c1n": 160,
      "c3ccc": 161,
      "ccc1": 162,
      ">>[": 163,
      "nc1": 164,
      "CS": 165,
      "cI": 166,
      "4C": 167,
      "CCCCCCCC": 168,
      "nc2": 169,
      "nn": 170,
      "+](": 171,
      "-].": 172,
      "@]": 173,
      "N2": 174,
      "2c": 175,
      "]\"": 176,
      "c1nc": 177,
      "Cc1cc": 178,
      "-])[": 179,
      "Cc1ccccc1": 180,
      "C3": 181,
      "CNC": 182,
      "ncc": 183,
      "CC3": 184,
      "].": 185,
      "@@]": 186,
      "][": 187,
      "1CC": 188,
      "O1": 189,
      "Nc1ccc": 190,
      "c2cccc": 191,
      "]>>": 192,
      "CH": 193,
      "CCCCC1": 194,
      "COc1cc": 195,
      "CCC1": 196,
      ":\"[": 197,
      "c4cc": 198,
      "c3c": 199,
      "Cc1c": 200,
      "n3": 201,
      "NS": 202,
      "c2ccccc21": 203,
      "CCCN": 204,
      "NN": 205,
      "NC1": 206,
      "+]([": 207,
      "s1": 208,
      "+][": 209,
      "NCC": 210,
      "NO": 211,
      "1O": 212,
      "Li": 213,
      "c1C": 214,
      "OC1": 215,
      "ccc4": 216,
      "OH": 217,
      "c2nc": 218,
      "3C": 219,
      "Cn1": 220,
      "])": 221,
      "-]\"": 222,
      "CCCC1": 223,
      "cn1": 224,
      "+]=[": 225,
      ")/": 226,
      "CCCCC": 227,
      "2cc": 228,
      "ccc12": 229,
      "C1C": 230,
      "OCc1ccccc1": 231,
      "CH2": 232,
      "CCl": 233,
      "c2c1": 234,
      "CBr": 235,
      "CN1": 236,
      "N1CCC": 237,
      "N1C": 238,
      "nc3": 239,
      "SC": 240,
      "OCCO": 241,
      "Oc1ccc": 242,
      "cc1C": 243,
      "O2": 244,
      "].[": 245,
      "c1ncc": 246,
      "]([": 247,
      "Cc1cccc": 248,
      "12": 249,
      "Mg": 250,
      "N3": 251,
      "c2ccc3": 252,
      "o1": 253,
      "c2n": 254,
      "sc": 255,
      "CCCCCC": 256,
      "CO1": 257,
      "cn": 258,
      "cN": 259,
      "c1ccc2c": 260,
      "c4ccccc4": 261,
      "C1CCC": 262,
      "(/": 263,
      "c4ccc": 264,
      "cc4": 265,
      "c1cn": 266,
      "OS": 267,
      ")([": 268,
      "C1CC": 269,
      "CCN1": 270,
      "OB": 271,
      "2CC": 272,
      "Cc2ccccc2": 273,
      "3CC": 274,
      "cB": 275,
      "OCc2ccccc2": 276,
      "oc": 277,
      "ncc1": 278,
      "c5": 279,
      "CCNC": 280,
      "1OC": 281,
      "c3cccc": 282,
      "c12": 283,
      "Cc2ccc": 284,
      "Nc1cc": 285,
      "N1CC": 286,
      "CCC2": 287,
      "cc21": 288,
      "CCCCC2": 289,
      "ccc2c1": 290,
      "N1CCN": 291,
      "CCCC2": 292,
      "cc1F": 293,
      "CC4": 294,
      "c2ncc": 295,
      "2O": 296,
      "n1nn": 297,
      "cc1Cl": 298,
      "N2C": 299,
      "H4": 300,
      "CCS": 301,
      "CCCO": 302,
      "n1cc": 303,
      "c1cnc": 304,
      "-](": 305,
      "C4": 306,
      "CCOC1": 307,
      "s2": 308,
      "On1nn": 309,
      "FC": 310,
      "Nc1ccccc1": 311,
      "COCC": 312,
      "CCOCC1": 313,
      "CN1C": 314,
      "cc12": 315,
      "cc1OC": 316,
      "C1CC1": 317,
      "Cc1n": 318,
      "n2c": 319,
      "Cs": 320,
      "nc21": 321,
      "Nc2ccc": 322,
      "COc1cccc": 323,
      "c1ccc2": 324,
      "-]=[": 325,
      "C1CCCCC1": 326,
      "ccc21": 327,
      "C1CCN": 328,
      "cc2c1": 329,
      "n1c": 330,
      "nc4": 331,
      "cn2": 332,
      "c2ccccc12": 333,
      "nn1": 334,
      "Nc1cccc": 335,
      "CCOCCO": 336,
      "cC": 337,
      "NC2": 338,
      "-][": 339,
      "N2CCN": 340,
      "CC1C": 341,
      "OCO": 342,
      "cccc": 343,
      "c1ccccc1C": 344,
      "Oc2ccc": 345,
      "ccc23": 346,
      "2OC": 347,
      "NNC": 348,
      "c1O": 349,
      "Cc": 350,
      "c2ccccc2C": 351,
      "CCCCCCC": 352,
      "Sn": 353,
      "nc12": 354,
      "Nc1nc": 355,
      "c1ccncc1": 356,
      "CCOCC2": 357,
      "n2cc": 358,
      "(\\": 359,
      "]>>[": 360,
      "c1F": 361,
      "c2ccc3c": 362,
      "1CCC": 363,
      "OP": 364,
      "OCC1": 365,
      "NH4": 366,
      "o2": 367,
      "])[": 368,
      ")-": 369,
      "12C": 370,
      "Cc1nc": 371,
      "ncc2": 372,
      "Cn1c": 373,
      "NCCC": 374,
      "C1CCOC1": 375,
      "c2cc3": 376,
      "CCc1ccc": 377,
      "OC2": 378,
      "ccn": 379,
      "CCBr": 380,
      "OCCC": 381,
      "+]=": 382,
      "On1nnc2ccccc21": 383,
      "ccccc": 384,
      "n1C": 385,
      "COC1": 386,
      "C1CO1": 387,
      "N2CCC": 388,
      "1CN": 389,
      "cc1c": 390,
      "Zn": 391,
      "@@](": 392,
      "C1CO": 393,
      "COc1ccccc1": 394,
      "CN2": 395,
      "c1Cl": 396,
      "Nc1n": 397,
      "Oc1ccccc1": 398,
      "CCOP": 399,
      "+].": 400,
      "c2n1": 401,
      "c2ccccc2C1": 402,
      "CSC": 403,
      "S1": 404,
      "CCCCO": 405,
      "@](": 406,
      "OCc3ccccc3": 407,
      "nc2c1": 408,
      "OO": 409,
      "c1cccnc1": 410,
      "](=": 411,
      "c1OC": 412,
      ")=[": 413,
      "c4c": 414,
      "ccccc3": 415,
      "CCOc1ccc": 416,
      "NCCCN": 417,
      "Al": 418,
      "cc2C": 419,
      "c2C": 420,
      "Cc1": 421,
      "CON": 422,
      "cc2F": 423,
      "CCOCC": 424,
      "c2cn": 425,
      "Nc3ccc": 426,
      "N4": 427,
      "-]#": 428,
      "Cc3ccccc3": 429,
      "COc1ccc2c": 430,
      "COS": 431,
      "c2cnc": 432,
      "c3nc": 433,
      "C2CC2": 434,
      "NCCO": 435,
      "CCCl": 436,
      "n1ccnc1": 437,
      "CCCC3": 438,
      "SH": 439,
      "2nc": 440,
      "C2C": 441,
      "CN1CCN": 442,
      "OCCCC": 443,
      "Cn1cc": 444,
      "cc2Cl": 445,
      "CCI": 446,
      "CH3": 447,
      "Nc2cc": 448,
      "Nc1c": 449,
      "CCOCC3": 450,
      "CCC3": 451,
      "c21": 452,
      "n4": 453,
      "c1cc2c": 454,
      "BH": 455,
      "21": 456,
      "/[": 457,
      "C2CCCCC2": 458,
      "ccc1C": 459,
      "cc1nc": 460,
      "Cc3ccc": 461,
      "c3ccccc32": 462,
      "CCN1C": 463,
      "c1ccccn1": 464,
      "CCCCCCCCCCCCCCCC": 465,
      "COCO": 466,
      "cc1O": 467,
      "CCO1": 468,
      "cO": 469,
      "c1cc2cc": 470,
      "COc1c": 471,
      "ccccc5": 472,
      "c23": 473,
      "n2C": 474,
      "c1cccc2": 475,
      "c1ccc2cc": 476,
      "Oc3ccc": 477,
      "Cc2cc": 478,
      "nn2": 479,
      "4CC": 480,
      "c2cccnc21": 481,
      "N2CCOCC2": 482,
      "CO2": 483,
      "NCc1ccc": 484,
      "2CCC": 485,
      "CCCCC3": 486,
      "CCCCO1": 487,
      "C1N": 488,
      "Fc1ccc": 489,
      "C1CN": 490,
      "cc23": 491,
      "CCCCCCCCCCCC": 492,
      "CCc1ccccc1": 493,
      "c3ncc": 494,
      "Cc1ccc2c": 495,
      "OCCN": 496,
      "OCC2": 497,
      "OCc1ccc": 498,
      "COP": 499,
      "-])([": 500,
      "c2nn": 501,
      "O3": 502,
      "Oc1cc": 503,
      "N2CC": 504,
      "c2ccccn2": 505,
      "nc1C": 506,
      "OCCO2": 507,
      "NCCN": 508,
      "c3c2": 509,
      "N1CCCC1": 510,
      "ccn1": 511,
      "c1N": 512,
      "c5ccccc5": 513,
      "c2cccnc2": 514,
      "cc1N": 515,
      "n2nc": 516,
      "cc2c": 517,
      "C1CCNCC1": 518,
      "c3ccc4": 519,
      "NC1CCCCC1": 520,
      "CCCCN": 521,
      "nc32": 522,
      "c4cccc": 523,
      "Se": 524,
      "s3": 525,
      "1CO": 526,
      "COc1cc2c": 527,
      "cn3": 528,
      "Cn": 529,
      "+]\"": 530,
      "NOC": 531,
      "CCOc1cc": 532,
      "nccc": 533,
      "sc1": 534,
      "CCNCC2": 535,
      "NC3": 536,
      "BH4": 537,
      "3O": 538,
      "ccc1O": 539,
      "cc32": 540,
      "On1nnc2cccnc21": 541,
      "Oc2ccccc2": 542,
      "cc1Br": 543,
      "ClCCl": 544,
      "CC1CC": 545,
      "ncn1": 546,
      "Cc1cn": 547,
      "Nc1ncc": 548,
      "c3ccccc23": 549,
      "N3CCN": 550,
      "NCc1ccccc1": 551,
      "CP": 552,
      "SiH": 553,
      "CF": 554,
      "OCOC": 555,
      "nnc": 556,
      "3CCC": 557,
      "ON": 558,
      "CCc1cc": 559,
      "CN1CCC": 560,
      "c2cccc3": 561,
      "ccc2n1": 562,
      "nc1Cl": 563,
      "c1ccccc1Cl": 564,
      "CCCN1C": 565,
      "ncc3": 566,
      "CC3CC": 567,
      "2C1": 568,
      "1CCCC": 569,
      "CCCNC": 570,
      "Cc1ccccc1C": 571,
      "ccccc4": 572,
      "oc1": 573,
      "N1CCOCC1": 574,
      "CCNCC1": 575,
      "N3CCOCC3": 576,
      "c2ccncc2": 577,
      "c1nn": 578,
      "1C2": 579,
      "ccc1F": 580,
      "CC1CC1": 581,
      "cc3F": 582,
      "c1nc2c": 583,
      "C5": 584,
      "NI": 585,
      "II": 586,
      "c1cncc": 587,
      "c1nnc": 588,
      "C12": 589,
      "Clc1ccc": 590,
      "c2ccnc": 591,
      "C1CCCC1": 592,
      "CB": 593,
      "C1OC": 594,
      "cccc1": 595,
      "c1csc": 596,
      "nc1c": 597,
      "C3CC3": 598,
      "Nc2nc": 599,
      "SCC": 600,
      "ccc2cc": 601,
      "cc2C1": 602,
      "]=": 603,
      "Nc2ccccc2": 604,
      "C1NC": 605,
      "CN1CC": 606,
      "2CCCC": 607,
      "C1CCCC": 608,
      "ICI": 609,
      "nn3": 610,
      "C1O": 611,
      "CC1CCCCC1": 612,
      "CCCS": 613,
      "3OC": 614,
      "c2cc3c": 615,
      "CN2C": 616,
      "c2F": 617,
      "OCCO1": 618,
      "c1sc": 619,
      "no1": 620,
      "1COC": 621,
      "NCCCC": 622,
      "Cc1ncc": 623,
      "NP": 624,
      "c1ccnc": 625,
      "Cc1cnc": 626,
      "cs1": 627,
      "nC": 628,
      "c2ccc3ccccc3": 629,
      "c1cccc2cc": 630,
      "ccc1Cl": 631,
      "c2C1": 632,
      "CCc1c": 633,
      "B2OC": 634,
      "c1cc2": 635,
      "c6": 636,
      "23": 637,
      "N3CCC": 638,
      "1N": 639,
      "32": 640,
      "c1s": 641,
      "OCC1c2ccccc2": 642,
      "Nc3cc": 643,
      "COc1ccc2": 644,
      "on1": 645,
      "c5ccc": 646,
      "cnc2": 647,
      "Cc2c": 648,
      "c1cccs1": 649,
      "N1CCCCC1": 650,
      "12CC": 651,
      "1NC": 652,
      "COc2ccc": 653,
      "CCCBr": 654,
      "cc3Cl": 655,
      "N1CCNCC1": 656,
      "n1nc": 657,
      "n3c": 658,
      "NCC1": 659,
      "CNC1": 660,
      "N2CCNCC2": 661,
      "CNS": 662,
      "OC3": 663,
      "CCCCCCCCCC": 664,
      "nc2c": 665,
      "cnc1": 666,
      "CCCCCCCCC": 667,
      "C1c2ccccc2C": 668,
      "OCO2": 669,
      "Oc1cccc": 670,
      "c3ccccc3C": 671,
      "c2cc1OC": 672,
      "5C": 673,
      "CCOCC4": 674,
      "cccc2": 675,
      "N3C": 676,
      "c3ccccc3C2": 677,
      "Oc2cc": 678,
      "C2CCN": 679,
      "ccc2c": 680,
      "-]>>[": 681,
      "BH3": 682,
      "c1nc2ccccc2": 683,
      "OCc2ccc": 684,
      ":[": 685,
      "CCn1c": 686,
      "NH": 687,
      "no": 688,
      "Nc": 689,
      "n2ccc": 690,
      "C1COCCN1": 691,
      "](/": 692,
      "N1Br": 693,
      "S2": 694,
      "C2CC": 695,
      "cc2cc": 696,
      "c3cnc": 697,
      "C1CCC2": 698,
      "Nc2n": 699,
      "n2cn": 700,
      "C3CCN": 701,
      "nnn1": 702,
      "ccc1OC": 703,
      "cccc21": 704,
      "CCCCl": 705,
      "CC5": 706,
      "CCN2": 707,
      "ccn2": 708,
      "ccc1N": 709,
      "C1COCCO1": 710,
      "cc5": 711,
      "c1Br": 712,
      "c1nccc": 713,
      "Cn1nc": 714,
      "]:": 715,
      "CNO": 716,
      "c3C": 717,
      "nc2cc": 718,
      "ccccc23": 719,
      "1CCN": 720,
      "nc23": 721,
      "-])=": 722,
      "Oc1c": 723,
      "ONC": 724,
      "c2s": 725,
      "CN1CCOCC1": 726,
      "c3n": 727,
      "SC1": 728,
      "OC1C": 729,
      "ccc32": 730,
      "c1ccccc1F": 731,
      "CN3": 732,
      "Cc1cc2c": 733,
      "OC1CCCCO1": 734,
      "Nc2ncc": 735,
      "c1ccc2nc": 736,
      "Nc1ccc2c": 737,
      "])=": 738,
      "])([": 739,
      "c1ccc2ccccc2c1": 740,
      "ClC": 741,
      "N1CCCC": 742,
      "c2ccc3ccccc3c2": 743,
      "ncn2": 744,
      "Cc2cccc": 745,
      "CC1CCC": 746,
      "ccc34": 747,
      "sc2c1": 748,
      "cc3C": 749,
      "NC1C": 750,
      "c1ccccc1Br": 751,
      "CSc1ccc": 752,
      "c1cccc2ccccc12": 753,
      "PH": 754,
      "ccc3c2": 755,
      "Nc2c": 756,
      "4c": 757,
      "2ccccc2c1": 758,
      "C1CCC1": 759,
      "Oc2c": 760,
      "OCc4ccccc4": 761,
      "COCCO": 762,
      "(=[": 763,
      "c3ccccn3": 764,
      "n3cc": 765,
      "c2sc": 766,
      "N2CCCC2": 767,
      "cc1NC": 768,
      "c3cccnc3": 769,
      "CCCCOC": 770,
      "CCCCCCCCCCC": 771,
      "c1nc2cc": 772,
      "CCSC": 773,
      "CCCCNC": 774,
      "OCCO3": 775,
      "2CN": 776,
      "Cc1ccc2": 777,
      "c1ccccc12": 778,
      "nc3cc": 779,
      "c2ccccc2Cl": 780,
      "nc2n1": 781,
      "c3nc4": 782,
      "Cc1nn": 783,
      "C1CC2": 784,
      "5CC": 785,
      "CNCC": 786,
      "C1COC": 787,
      "2O1": 788,
      "CCOCCOCCOCCO": 789,
      "cnc": 790,
      "ccc4C": 791,
      "c2ccccc2c1": 792,
      "21C": 793,
      "c1ccccc1O": 794,
      "1cc": 795,
      "C2CCC": 796,
      "nn2C": 797,
      "BrCc1ccccc1": 798,
      "c3ccc4c": 799,
      "o3": 800,
      "Brc1ccc": 801,
      "c2c1C": 802,
      "CCCc1c": 803,
      "N3CC": 804,
      "1c1ccc": 805,
      "sc1C": 806,
      "c3n2": 807,
      "nn12": 808,
      "cc3c2": 809,
      "CCC4": 810,
      "COc1cc2": 811,
      "c2nnc": 812,
      "1CCCN1C": 813,
      "sc2": 814,
      "ccc2C": 815,
      "ncn": 816,
      "COB": 817,
      "-]#[": 818,
      "n12": 819,
      "n1Cc1ccc": 820,
      "C1CCNC1": 821,
      "COc1nc": 822,
      "nCO": 823,
      "CCn1": 824,
      "CC12": 825,
      "c1cnc2c": 826,
      "cc1cc": 827,
      "Nc2cccc": 828,
      "COCCOC": 829,
      "1CCCN1": 830,
      "NC1CC1": 831,
      "c4ccc5": 832,
      "c4ccccc4C": 833,
      "onc": 834,
      "NCc2ccc": 835,
      "Cn2c": 836,
      "CCCC4": 837,
      "c3cccc4": 838,
      "CC2C": 839,
      "cc3c": 840,
      "Sc1ccccc1": 841,
      "c2nc3ccccc3": 842,
      "c3ccnc": 843,
      "c1cc2ccccc2": 844,
      "OCC3": 845,
      "c1ccn": 846,
      "c3ccncc3": 847,
      "N4CCOCC4": 848,
      "Oc3ccccc3": 849,
      "Clc1nc": 850,
      "CCCOC": 851,
      "C4C": 852,
      "BrBr": 853,
      "Sc1ccc": 854,
      "Fc1cc": 855,
      "NCO": 856,
      "ccc1Br": 857,
      "no2": 858,
      "COCOC": 859,
      "\\[": 860,
      "c1cnn": 861,
      "ccc2F": 862,
      "nc1N": 863,
      "CCNCC": 864,
      "CCCCBr": 865,
      "C4CC4": 866,
      "CC1CO1": 867,
      "nc5": 868,
      "C2CCCC2": 869,
      "2COC": 870,
      "COCCN": 871,
      "IC": 872,
      "C1c2ccccc2": 873,
      "CNc1ccc": 874,
      "SCCC": 875,
      "c3cnn": 876,
      "COc1ccccc1C": 877,
      "c1ccccc1N": 878,
      "c2ccccc2F": 879,
      "Clc1cc": 880,
      "2CO": 881,
      "c1o": 882,
      "COCc1ccccc1": 883,
      "COC2": 884,
      "C3CCCCC3": 885,
      "CCCCO2": 886,
      "OCO3": 887,
      "OCc3ccc": 888,
      "N2CCCCC2": 889,
      "NC1CCN": 890,
      "c32": 891,
      "cnc3": 892,
      "nnn": 893,
      "CCc2ccc": 894,
      "Cu": 895,
      "C1C2": 896,
      "cccc1Cl": 897,
      "cc2n1": 898,
      "CC2CC2": 899,
      "c2cccs2": 900,
      "c1ccsc1": 901,
      "12CCC": 902,
      "COc1ncc": 903,
      "cS": 904,
      "Cc1cccnc1": 905,
      "cc1ccc": 906,
      "Cc1noc": 907,
      "c1nc2ccc": 908,
      "c2nc3cc": 909,
      "CCCCCC1": 910,
      "CCOS": 911,
      "c2nc3c": 912,
      "2ncnc": 913,
      "c2Cl": 914,
      "nn1C": 915,
      "c1ccco1": 916,
      "c2cncc": 917,
      "N1CCC2": 918,
      "CO3": 919,
      "COc1cccc2": 920,
      "CCCc1ccc": 921,
      "Nc1ccccc1C": 922,
      "OCCOC": 923,
      "NC4": 924,
      "CCN1CCC": 925,
      "N5": 926,
      "nc3c": 927,
      "ccc2C1": 928,
      "cs2": 929,
      "c2noc": 930,
      "n2c1": 931,
      "n2ccnc2": 932,
      "CN1CCCC1": 933,
      "c2cnn": 934,
      "SS": 935,
      "CCc1cccc": 936,
      "N4CCN": 937,
      "cc1ccn": 938,
      "B1OC": 939,
      "13": 940,
      "ccs": 941,
      "n2ccc3": 942,
      "CCN1CCN": 943,
      "ClCCCl": 944,
      "c34": 945,
      "c1NC": 946,
      "oc2c1": 947,
      "2ccc": 948,
      "ON1C": 949,
      "OCCCO": 950,
      "NC1CC": 951,
      "Nc4ccc": 952,
      "Oc1ccc2c": 953,
      "ccccB": 954,
      "Cc4ccccc4": 955,
      "CCCI": 956,
      "ncnc2": 957,
      "oc12": 958,
      "c2ccc3nc": 959,
      "cCO": 960,
      "cccc1F": 961,
      "c2ccccc2n1": 962,
      "CCc2ccccc2": 963,
      "OC1CC": 964,
      "2CCN": 965,
      "CC1CN": 966,
      "Nc3ccccc3": 967,
      "COc": 968,
      "Nc3cccc": 969,
      "CCCc1ccccc1": 970,
      "c3cn": 971,
      "C2CCNCC2": 972,
      "@+]([": 973,
      "Sc2ccc": 974,
      "CCCCC4": 975,
      "CCNC2": 976,
      "n1cn": 977,
      "COCc2ccccc2": 978,
      "CCNS": 979,
      "ccc2ccccc12": 980,
      "c1ccccc1I": 981,
      "c2nccc": 982,
      "nc2C": 983,
      "NCCCN2": 984,
      "CCC1C": 985,
      "1c1ccccc1": 986,
      "+])": 987,
      "2C3": 988,
      "Fc1cccc": 989,
      "nc2ccc": 990,
      "c2s1": 991,
      "c1noc": 992,
      "#[": 993,
      "cc34": 994,
      "CCn1cc": 995,
      "c2ccco2": 996,
      "1ccccc1": 997,
      "NCc1cccc": 998,
      "CN1CCNCC1": 999,
      "CCO2": 1000,
      "NCC2": 1001,
      "COCCC": 1002,
      "Oc2cccc": 1003,
      "c4ccccc43": 1004,
      "n3C": 1005,
      "C1CCOCC1": 1006,
      "CCCCO3": 1007,
      "CCN1CCOCC1": 1008,
      "c1cccc2c1": 1009,
      "@@+]([": 1010,
      "BrC": 1011,
      "1CCCN": 1012,
      "sc12": 1013,
      "c2csc": 1014,
      "CS1": 1015,
      "ncc2c1": 1016,
      "CSCC": 1017,
      "OCCCN": 1018,
      "nc3c2": 1019,
      "CC1CCN": 1020,
      "ncnc32": 1021,
      "nc1n": 1022,
      "BrB": 1023,
      "cc1ccnc1c": 1024,
      "cccc1C": 1025,
      "cccc12": 1026,
      "cc1ncnc1c": 1027,
      "n2n1": 1028,
      "Cc1ccncc1": 1029,
      "c2cc3ccccc3": 1030,
      "Cc1cc2cc": 1031,
      "n2cnc3c": 1032,
      "c4ncc": 1033,
      "n1cnc": 1034,
      "Cc1ccnc": 1035,
      "O4": 1036,
      "N3CCNCC3": 1037,
      "Cc3cc": 1038,
      "cc1I": 1039,
      "c2nnn": 1040,
      "CCNCC3": 1041,
      "cccc4": 1042,
      "CCCCCCCCCCCCCC": 1043,
      "CN4": 1044,
      "Nc1nccc": 1045,
      "Nc1ccc2": 1046,
      "NCCCN2CC1": 1047,
      "B3OC": 1048,
      "Cc1oc": 1049,
      "c1nnnn1": 1050,
      "SCCS": 1051,
      "23C": 1052,
      "OCC2CC2": 1053,
      "n1ccc": 1054,
      "CCN3": 1055,
      "CCCOc1ccc": 1056,
      "c1ccccc1OC": 1057,
      "ccc1NC": 1058,
      "c4c3": 1059,
      "C12CC3CC": 1060,
      "CCC1CC2": 1061,
      "43C": 1062,
      "c4ccccc34": 1063,
      "CCCN2C": 1064,
      "oc1c": 1065,
      "oc2cc": 1066,
      "c2ccccc2N": 1067,
      "N1CC2": 1068,
      "OCI": 1069,
      "cc1OCc1ccccc1": 1070,
      "CN2CCN": 1071,
      "cc2s1": 1072,
      "N12": 1073,
      "34": 1074,
      "Cn1ccc": 1075,
      "s4": 1076,
      "c2ncn": 1077,
      "c1c2c": 1078,
      "c2ccc3cc": 1079,
      "-]=": 1080,
      "OCCBr": 1081,
      "CSC1": 1082,
      "CN2CCC": 1083,
      "Cc1csc": 1084,
      "CCN1CC": 1085,
      "CCc": 1086,
      "cc1S": 1087,
      "c1ccccc1S": 1088,
      "Oc3cc": 1089,
      "CCN2C": 1090,
      "c1I": 1091,
      "3CCC4": 1092,
      "CSc1nc": 1093,
      "CC1CCCC1": 1094,
      "c3F": 1095,
      "Nc1ncnc2": 1096,
      "CCc1nc": 1097,
      "COc1ccc2cc": 1098,
      "c1cs": 1099,
      "n5": 1100,
      "CCCCCBr": 1101,
      "COc1cc2nccc": 1102,
      "OCc1cc": 1103,
      "2N": 1104,
      "Nc3nc": 1105,
      "OBO": 1106,
      "Cn2": 1107,
      "Cc1ccccn1": 1108,
      "2CC3CC": 1109,
      "Cc1cccc2": 1110,
      "c1cnc2": 1111,
      "NC1CCC": 1112,
      "Cc1ccccc1O": 1113,
      "CCCCCN": 1114,
      "ncnc21": 1115,
      "NCc2ccccc2": 1116,
      "3CC4CC": 1117,
      "ccc3ccccc23": 1118,
      "c2ncnc": 1119,
      "ncc4": 1120,
      "n2CC": 1121,
      "1CC2": 1122,
      "c4ccccc4C3": 1123,
      "c1ncon1": 1124,
      "OCO4": 1125,
      "CNc1cc": 1126,
      "CCOC2": 1127,
      "3c": 1128,
      "C3CCNCC3": 1129,
      "c1nnn": 1130,
      "C1CNC1": 1131,
      "Nc3ncc": 1132,
      "cnn": 1133,
      "Cn2cc": 1134,
      "4O": 1135,
      "cnc12": 1136,
      "ncc1C": 1137,
      "c1ccc2ncc": 1138,
      "NNc1ccc": 1139,
      "ccc5": 1140,
      "cccc2c1": 1141,
      "2NC": 1142,
      "N3CCCC3": 1143,
      "cn4": 1144,
      "c4nc": 1145,
      "CCCCCCCCCCCCC": 1146,
      "Cc1ccccc1Br": 1147,
      "Cn1cn": 1148,
      "C1CS": 1149,
      "c2o": 1150,
      "CCCc1cc": 1151,
      "SP": 1152,
      "CNC2": 1153,
      "NCCc1ccc": 1154,
      "c1Cc1ccc": 1155,
      "C1c1ccc": 1156,
      "CCCCCO": 1157,
      "Cc1ccccc1Cl": 1158,
      "ccn4": 1159,
      "CNN": 1160,
      "c1c2ccccc2": 1161,
      "CCC1CC": 1162,
      "CCCCCl": 1163,
      "Oc4ccc": 1164,
      "NCc1cc": 1165,
      "c2cc3cc": 1166,
      "N1O": 1167,
      "C3C": 1168,
      "c1CC": 1169,
      "CCCCc1ccc": 1170,
      "oc2": 1171,
      "Cc1ccc2ccccc2c1": 1172,
      "OCCI": 1173,
      "cnc21": 1174,
      "NC2CC2": 1175,
      "c2ccn": 1176,
      "Cc1nnc": 1177,
      "c3cnc4": 1178,
      "C6": 1179,
      "nc2ccccc12": 1180,
      "c3nn": 1181,
      "CCON": 1182,
      "Cc4ccc": 1183,
      "CCCn1c": 1184,
      "CNc1nc": 1185,
      "OOC": 1186,
      "Cc1cccs1": 1187,
      "c1oc": 1188,
      "SiH2": 1189,
      "Cc1nc2c": 1190,
      "N1CCO": 1191,
      "C1COCO1": 1192,
      "cc1ncc": 1193,
      "3CCCC": 1194,
      "cccc3": 1195,
      "OCc1c": 1196,
      "CCCCCCCCCCCCCCC": 1197,
      "cc2OC": 1198,
      "c3nnc": 1199,
      "-])(": 1200,
      "N1c1ccc": 1201,
      "Nc1nc2c": 1202,
      "cc1OCC": 1203,
      "CN2CC": 1204,
      "2SC1": 1205,
      "Clc1cccc": 1206,
      "n3ccc": 1207,
      "OCCCCCC": 1208,
      "c3ccccc3Cl": 1209,
      "c1cnnc1": 1210,
      "1CNC": 1211,
      "c2ccccc2O": 1212,
      "COc1cc2ncnc": 1213,
      "c2cnc3c": 1214,
      "N1S": 1215,
      "c3cc4": 1216,
      "OC1CCCC1": 1217,
      "Nc4cc": 1218,
      "N2CCCC": 1219,
      "ccc2o1": 1220,
      "CCCCCCO": 1221,
      "Oc": 1222,
      "OC1CCC": 1223,
      "c1ccoc1": 1224,
      "COCc1ccc": 1225,
      "ccc2Cl": 1226,
      "Cc1ccc2cc": 1227,
      "SCCCS1": 1228,
      "Sc2ccccc2": 1229,
      "Cc3cccc": 1230,
      "OI": 1231,
      "43": 1232,
      "c5cc": 1233,
      "n23": 1234,
      "c3C2": 1235,
      "CCCCCCCCCCCCCCCCCC": 1236,
      "C2CN": 1237,
      "1CO1": 1238,
      "cc4F": 1239,
      "NCCNC": 1240,
      "NCCCO": 1241,
      "COCC1": 1242,
      "OC2CCCCO2": 1243,
      "N3CCCCC3": 1244,
      "CCCCCCC1": 1245,
      "CNOC": 1246,
      "FC1": 1247,
      "Nc1cnc": 1248,
      "NCc3ccc": 1249,
      "c2nc3ccc": 1250,
      "OC4": 1251,
      "COc2cc": 1252,
      "Cn1ccnc1": 1253,
      "c2nc3": 1254,
      "ccc4c3": 1255,
      "CCO3": 1256,
      "Cc2ccccc21": 1257,
      "1CCC2": 1258,
      "oc1C": 1259,
      "OCCO4": 1260,
      "CC2CCCC2": 1261,
      "CCCCc1nc": 1262,
      "ccc2N1": 1263,
      "c5c": 1264,
      "n2ncc": 1265,
      "ccn3": 1266,
      "ccc3n2": 1267,
      "c1cccc2c": 1268,
      "ccc13": 1269,
      "COCCC1": 1270,
      "OCCCCCCCC": 1271,
      "ncc12": 1272,
      "c1OCc1ccccc1": 1273,
      "NCN": 1274,
      "cc2N": 1275,
      "c2oc": 1276,
      "CCOC1CCCCO1": 1277,
      "C3CCCC3": 1278,
      "c1ncccn1": 1279,
      "cccc2Cl": 1280,
      "nc3ccccc3": 1281,
      "CCCCS": 1282,
      "c3cccs3": 1283,
      "NCCS": 1284,
      "c3cc4c": 1285,
      "OC1CCCCC1": 1286,
      "Nc1nnc": 1287,
      "c1cncn1": 1288,
      "n3nc": 1289,
      "ccccc34": 1290,
      "COC3": 1291,
      "Cn1ncc": 1292,
      "2CCCCO2": 1293,
      "])(": 1294,
      "CCCCCCN": 1295,
      "NH3": 1296,
      "CC2CCCCC2": 1297,
      "Cn2nc": 1298,
      "CCNC1": 1299,
      "c2nccs2": 1300,
      "n1Cc1ccccc1": 1301,
      "ccc1OCc1ccccc1": 1302,
      "Nc2nccc": 1303,
      "Cc1ccccc1N": 1304,
      "c1nccs1": 1305,
      "cnc32": 1306,
      "Oc1nc": 1307,
      "CCOc1c": 1308,
      "C1CNCCN1": 1309,
      "c3cncc": 1310,
      "Brc1ccccc1": 1311,
      "N1CCc2c": 1312,
      "Cc1cccc2cc": 1313,
      "c3csc": 1314,
      "Cc1cncc": 1315,
      "c1ncnn1": 1316,
      "NN1": 1317,
      "CCP": 1318,
      "cc2N1": 1319,
      "1CCNC1": 1320,
      "n1ccc2c": 1321,
      "c2ncnc3": 1322,
      "Cr": 1323,
      "cn12": 1324,
      "c1cnc2ccc": 1325,
      "N1Cl": 1326,
      "COCOc1ccc": 1327,
      "c1cncnc1": 1328,
      "c2Oc2c": 1329,
      "c2O": 1330,
      "cc2nc": 1331,
      "Ic1ccccc1": 1332,
      "C1CCc2cc": 1333,
      "c1ccnc1": 1334,
      "COc3ccc": 1335,
      "c5cccc": 1336,
      "C1NCC": 1337,
      "c1ncn2": 1338,
      "c3ncnc": 1339,
      "ccc3F": 1340,
      "C2CCC2": 1341,
      "C21": 1342,
      "OCCN2": 1343,
      "cccc3Cl": 1344,
      "CC1CCCC": 1345,
      "cccc2F": 1346,
      "NCCC1": 1347,
      "Oc2ccc3c": 1348,
      "c1cc2ccc": 1349,
      "COC1CCCCO1": 1350,
      "c3ccc4ccccc4": 1351,
      "CCN1CCCC1": 1352,
      "1OCc1ccccc1": 1353,
      "cnc2c1": 1354,
      "CCCCOc1ccc": 1355,
      "c3noc": 1356,
      "NC2CCN": 1357,
      "N4C": 1358,
      "nc43": 1359,
      "OCC4": 1360,
      "oc2ccc": 1361,
      "ccccc6": 1362,
      "CCCN3": 1363,
      "c2ccsc2": 1364,
      "OCCCl": 1365,
      "c4ccccn4": 1366,
      "c2ccccc2N1": 1367,
      "ncc2c": 1368,
      "1Cc1ccccc1": 1369,
      "Cc2ccccc2C1": 1370,
      "ccc2c1C": 1371,
      "N4CCC": 1372,
      "c1S": 1373,
      "CCCc1nc": 1374,
      "nnn2": 1375,
      "N1CC1": 1376,
      "Nc2ccccc21": 1377,
      "NC2CCCCC2": 1378,
      "Nc1cccc2": 1379,
      "c2c1cc": 1380,
      "31": 1381,
      "cc3n2": 1382,
      "oc2C": 1383,
      "nn23": 1384,
      "NO1": 1385,
      "c1cnoc1": 1386,
      "n1ccc2cc": 1387,
      "Oc1cccc2": 1388,
      "c2O1": 1389,
      "CC1C3": 1390,
      "nc2ccccc21": 1391,
      "CCc2ccccc21": 1392,
      "Cc1ccc2nc": 1393,
      "nc2nc": 1394,
      "CC3CC3": 1395,
      "COc1ccc2nc": 1396,
      "1OCCO1": 1397,
      "CCNCC4": 1398,
      "+]>>[": 1399,
      "c4ccc5c": 1400,
      "Nc1cccnc1": 1401,
      "c3nc4ccccc4": 1402,
      "c1coc": 1403,
      "c1cnccc1": 1404,
      "C1CNC": 1405,
      "OCc2c": 1406,
      "Cc1cs": 1407,
      "C2C1": 1408,
      "CCOc1ccccc1": 1409,
      "C2CCCC": 1410,
      "ccc1OCC": 1411,
      "c4cnc": 1412,
      "3C2": 1413,
      "CCCO2": 1414,
      "oc2ccccc12": 1415,
      "OC1CCN": 1416,
      "OCc1cccc": 1417,
      "C12C": 1418,
      "c3s2": 1419,
      "cc6": 1420,
      "Cc1sc": 1421,
      "n1cccc1": 1422,
      "N21": 1423,
      "c2cnc3": 1424,
      "4CCC": 1425,
      "c3ccccc31": 1426,
      "Fc1c": 1427,
      "c3ccccc3c2": 1428,
      "CCc2cc": 1429,
      "c2ccccc2P": 1430,
      "c7": 1431,
      "c1cccnc1Cl": 1432,
      "CCc1nc2c": 1433,
      "nc3ccc": 1434,
      "OCCNC": 1435,
      "CC1C2": 1436,
      "Cc1onc": 1437,
      "Fc1ccccc1": 1438,
      "1ccc": 1439,
      "CCOCC5": 1440,
      "c2ncccc12": 1441,
      "cc43": 1442,
      "Mn": 1443,
      "sc3": 1444,
      "COc2ccccc2": 1445,
      "c2cccc3ccccc23": 1446,
      "Clc1ncc": 1447,
      "CNCC2": 1448,
      "4OC": 1449,
      "N2CCC3": 1450,
      "Cc3c": 1451,
      "OCCCCl": 1452,
      "C2OC": 1453,
      "ccc2O1": 1454,
      "c3nccc": 1455,
      "c2c3c": 1456,
      "c6ccc": 1457,
      "C1OCC": 1458,
      "o4": 1459,
      "c2N": 1460,
      "CCC12": 1461,
      "c1ccccc1NC": 1462,
      "Nc1nc2ccc": 1463,
      "1CN2": 1464,
      "C1CCCCO1": 1465,
      "cc4C": 1466,
      "ccc2N": 1467,
      "CCOc2ccc": 1468,
      "Nc1cncc": 1469,
      "OCCOc1ccc": 1470,
      "Cc1ccccc1F": 1471,
      "nn2c": 1472,
      "CCOc1cccc": 1473,
      "SC2": 1474,
      "Brc1cccc": 1475,
      "COCCOCCO": 1476,
      "C1CSC": 1477,
      "cnn1": 1478,
      "CCOC3": 1479,
      "c1cn2c": 1480,
      "n2cccn2": 1481,
      "Nc1nccs1": 1482,
      "ncn3": 1483,
      "nn4": 1484,
      "ccc1S": 1485,
      "Nc1ccccn1": 1486,
      "c2ccccc2S": 1487,
      "CSc1ccccc1": 1488,
      "P1": 1489,
      "cc2O": 1490,
      "12O": 1491,
      "c2ncccn2": 1492,
      "]#": 1493,
      "COCCCC": 1494,
      "c1ccccc1C2": 1495,
      "Cc1s": 1496,
      "cccc32": 1497,
      "cco": 1498,
      "C3CC": 1499,
      "Cn1cncn1": 1500,
      "n3n2": 1501,
      "CCF": 1502,
      ")(/": 1503,
      "Nc2ccc3c": 1504,
      "Oc4ccccc4": 1505,
      "cccc3F": 1506,
      "N1c2ccc": 1507,
      "OCCCBr": 1508,
      "CCCCCNC": 1509,
      "Nc1ccccc1N": 1510,
      "CCCCCCBr": 1511,
      "n3ccnc3": 1512,
      "Te": 1513,
      "nc4cc": 1514,
      "CN1CCCCC1": 1515,
      "c2ccccc2c": 1516,
      "IP": 1517,
      "Oc3cccc": 1518,
      "Nc1ccn": 1519,
      "c3ccccc3F": 1520,
      "C1CCCN": 1521,
      "OCCS": 1522,
      "ncnc": 1523,
      "cc2o1": 1524,
      "CCC1C2": 1525,
      "ccnc2": 1526,
      "n4cc": 1527,
      "NH2": 1528,
      "Oc1ccccc1C": 1529,
      "CONC": 1530,
      "ClP": 1531,
      "cc2ccc": 1532,
      "n1ncc": 1533,
      "nc2c1c": 1534,
      "CCCCP": 1535,
      "SCCCS": 1536,
      "N1Cc1ccccc1": 1537,
      "3COC": 1538,
      "c4cccnc4": 1539,
      "CN2CCOCC2": 1540,
      "CC1O": 1541,
      "ccc1c": 1542,
      "ccc2ccc": 1543,
      "1O2": 1544,
      "ncc2cc": 1545,
      "c2cnn3": 1546,
      "Cc1cc2": 1547,
      "cnc1N": 1548,
      "nS": 1549,
      "Cc2ccc3c": 1550,
      "c1ncc2c": 1551,
      "ICCI": 1552,
      "3CO": 1553,
      "23CC": 1554,
      "BC": 1555,
      "Cn1nn": 1556,
      "C2CCOCC2": 1557,
      "CC21": 1558,
      "c2OC": 1559,
      "c3sc": 1560,
      "OCCN3": 1561,
      "nc2s1": 1562,
      "CCN1CCCCC1": 1563,
      "NCCCCCC": 1564,
      "C1CCCN1": 1565,
      "Oc2ncc": 1566,
      "c2ccc3ncc": 1567,
      "ccc3C": 1568,
      "c3nnn": 1569,
      "C2OCCO2": 1570,
      "nc4c3": 1571,
      "CCCCN1C": 1572,
      "CCCCI": 1573,
      "cc1NS": 1574,
      "6C": 1575,
      "SCC1": 1576,
      "cc1CC": 1577,
      "cc3C2": 1578,
      "ccccc32": 1579,
      "Nc3c": 1580,
      "ccc2s1": 1581,
      "5c": 1582,
      "cc3OC": 1583,
      "CCc2c": 1584,
      "c1co": 1585,
      "OC2CCN": 1586,
      "N1CCc2cc": 1587,
      "nccc1": 1588,
      "C1Nc2ccc": 1589,
      "ncc1Cl": 1590,
      "Nc1cccc2ccc": 1591,
      "Cc1ccco1": 1592,
      "cc2NC": 1593,
      "COc1cnc": 1594,
      "OI1": 1595,
      "c6ccccc6": 1596,
      "1c": 1597,
      "CCn": 1598,
      "cc2c1C": 1599,
      "Cc2ccccc2C": 1600,
      "n2cnc": 1601,
      "cc1ncnc": 1602,
      "cccc2C": 1603,
      "cnc1Cl": 1604,
      "n1cnc2c": 1605,
      "N4CC": 1606,
      "Nn": 1607,
      "c3Cl": 1608,
      "c2o1": 1609,
      "Cc1ccccc1S": 1610,
      "ccccc45": 1611,
      "C1OCCO1": 1612,
      "Nc1cn": 1613,
      "1OCC": 1614,
      "Ca": 1615,
      "c1cnccn1": 1616,
      "CC1NC": 1617,
      "c1ncccc1": 1618,
      "NC1CCCC1": 1619,
      "Cc1cccc2ccccc12": 1620,
      "3CN": 1621,
      "c1ccc2oc": 1622,
      "CCN3C": 1623,
      "N2CC3": 1624,
      "Nc4cccc": 1625,
      "5O": 1626,
      "on2": 1627,
      "Cn1cnc": 1628,
      "Hg": 1629,
      "c3s": 1630,
      "c2cc1": 1631,
      "sc1c": 1632,
      "ccc3c": 1633,
      "Clc1ccc2c": 1634,
      "CCc1cc2c": 1635,
      "c1ccc2ccc": 1636,
      "CCCCn1c": 1637,
      "Clc1ccccc1": 1638,
      "nc1OC": 1639,
      "NCCc1c": 1640,
      "CCc3ccc": 1641,
      "OCCCCC": 1642,
      "CCn1nc": 1643,
      "CCN2CCC": 1644,
      "NCCc1ccccc1": 1645,
      "OCC2c3ccccc3": 1646,
      "2CO2": 1647,
      "nc4c": 1648,
      "co1": 1649,
      "CCc1cnc": 1650,
      "CC1OC": 1651,
      "NCc3ccccc3": 1652,
      "c2ccccc2OC": 1653,
      "c1CO": 1654,
      "C1Nc2ccccc2C1": 1655,
      "FB": 1656,
      "CNc1ccccc1": 1657,
      "N1CCCN": 1658,
      "CNc2nc": 1659,
      "Cc1nc2cc": 1660,
      "c1nc2ccccc2s1": 1661,
      "c1ccccc1P": 1662,
      "CCOCc1ccccc1": 1663,
      "S3": 1664,
      "COCN": 1665,
      "NCC3": 1666,
      "OC1CC1": 1667,
      "CCB": 1668,
      "c2ccccc2Br": 1669,
      "sc23": 1670,
      "(#": 1671,
      "NC3CC3": 1672,
      "c4cnn": 1673,
      "sc2n1": 1674,
      "Cn1c2c": 1675,
      "c1cnn2": 1676,
      "N1CCOC1": 1677,
      "C1Cc2cc": 1678,
      "oc3": 1679,
      "cc2Br": 1680,
      "cc4c3": 1681,
      "Oc1ccc2ccccc2c1": 1682,
      "c2cccc3c2": 1683,
      "C1c1ccccc1": 1684,
      "Brc1ccc2c": 1685,
      "COC1C": 1686,
      "Nc1cccc2cccnc12": 1687,
      "OCCc1ccc": 1688,
      "Cc2cnc": 1689,
      "cc1CN": 1690,
      "n2nn": 1691,
      "CN3CCN": 1692,
      "c1OCC": 1693,
      "CN3C": 1694,
      "c2ccccc2O1": 1695,
      "ccnc1": 1696,
      "C2CCCCO2": 1697,
      "c4C": 1698,
      "Oc3ccc4": 1699,
      "Cc2nc": 1700,
      "CCCN2": 1701,
      "ccc2O": 1702,
      "OCC1CO1": 1703,
      "12CCCC": 1704,
      "cc2ccccc12": 1705,
      "OCCC2": 1706,
      ")\\": 1707,
      "C1SC": 1708,
      "NCI": 1709,
      "As": 1710,
      "cc2O1": 1711,
      "c3c1O": 1712,
      "c1cnnn1": 1713,
      "c1CCC": 1714,
      "cc3s2": 1715,
      "CC2C1": 1716,
      "CCOCCOCCO": 1717,
      "ccc2OC": 1718,
      "10": 1719,
      "nn2c1": 1720,
      "nnc12": 1721,
      "nc3C": 1722,
      "c1cnc2cc": 1723,
      "cc1CO": 1724,
      "nn3C": 1725,
      "c1ccc2ncccc2c1": 1726,
      "c3nc4c": 1727,
      "3CCN": 1728,
      "NCCCl": 1729,
      "3C4": 1730,
      "cc1nccc": 1731,
      "c1nnco1": 1732,
      "c3ccccc3c": 1733,
      "SCS": 1734,
      "ClCc1ccc": 1735,
      "N1CCc2ccc": 1736,
      "n2ccc3c": 1737,
      "C3CCC": 1738,
      "C1COC1": 1739,
      "ccc2n1C": 1740,
      "CCNC3": 1741,
      "2CCCN2C": 1742,
      "CCNc1ccc": 1743,
      "se": 1744,
      "sc3c2": 1745,
      "cn2n1": 1746,
      "OCC1CC1": 1747,
      "Nc1cc2c": 1748,
      "N2C1": 1749,
      "Nc1ccncc1": 1750,
      "Oc2nc": 1751,
      "C2O": 1752,
      "Sc3ccc": 1753,
      "Ge": 1754,
      "c3c2C": 1755,
      "CN2CCCC2": 1756,
      "OCc2cccc": 1757,
      "N1CCC1": 1758,
      "+]#": 1759,
      "c3ccco3": 1760,
      "CNCCO": 1761,
      "c1ccccc21": 1762,
      "Oc2ccnc": 1763,
      "CCCO1": 1764,
      "ClCc1ccccc1": 1765,
      "CN2CCCCC2": 1766,
      "CCCC5": 1767,
      "ccnc": 1768,
      "N1Cc2ccc": 1769,
      "C1C2C": 1770,
      "CCc3ccccc3": 1771,
      "OCCl": 1772,
      "ccc3C2": 1773,
      "OCC3CC3": 1774,
      "COc1cc2nc": 1775,
      "N1CCn2c": 1776,
      "cccc23": 1777,
      "CC6": 1778,
      "COCCOc1cc": 1779,
      "OCc2cc": 1780,
      "c2ccccc2c1C": 1781,
      "CSc1cc": 1782,
      "c2ccc3ccccc3n2": 1783,
      "C1CCCC2": 1784,
      "2CNC": 1785,
      "CNc2ccc": 1786,
      "COCc3ccccc3": 1787,
      "CCCCCCCCCCC1": 1788,
      "nc2c1C": 1789,
      "COc1n": 1790,
      "Oc1ccc2": 1791,
      "scc": 1792,
      "cnn3": 1793,
      "C2N": 1794,
      "nc1Br": 1795,
      "n3c2": 1796,
      "cc3ccc": 1797,
      "c3cccc4c3": 1798,
      "cnc1C": 1799,
      "COc3ccccc3": 1800,
      "CCN2CCN": 1801,
      "c3ccccc13": 1802,
      "cc1cccnc1c": 1803,
      "Cc3ccccc32": 1804,
      "Cc1nc2ccc": 1805,
      "CCCCCc1ccc": 1806,
      "c5c4": 1807,
      "CCCCCCCCO": 1808,
      "2OCC": 1809,
      "C3CCCCO3": 1810,
      "cc2n1C": 1811,
      "c4nc5": 1812,
      "C1CCCO1": 1813,
      "cs3": 1814,
      "CC2CC": 1815,
      "nc1O": 1816,
      "N1C2": 1817,
      "Fc1ccc2c": 1818,
      "CCOCO": 1819,
      "Nc2ccccc2C": 1820,
      "sc2c": 1821,
      "oc2c": 1822,
      "ccc43": 1823,
      "C1Cl": 1824,
      "nc2N": 1825,
      "c4cccc5": 1826,
      "nccc12": 1827,
      "CC3C": 1828,
      "ccncc": 1829,
      "Cc1cc2nc": 1830,
      "1CN2CCC1CC2": 1831,
      "CSc1ncc": 1832,
      "nO": 1833,
      "nccc2c1": 1834,
      "OCCN4": 1835,
      "OCc5ccccc5": 1836,
      "cn2C": 1837,
      "32C": 1838,
      "c3ccccc3n2": 1839,
      "c4ccncc4": 1840,
      "cc1cnc": 1841,
      "CNNC": 1842,
      "Ic1ccc": 1843,
      "cccc2n1": 1844,
      "ccccI": 1845,
      "P2": 1846,
      "Cc1ccsc1": 1847,
      "ncc2C": 1848,
      "OC1CCNCC1": 1849,
      "nc3ccccc23": 1850,
      "nc34": 1851,
      "c1cocn1": 1852,
      "CNC3": 1853,
      "c2c1c": 1854,
      "ccn2C": 1855,
      "cnn2C": 1856,
      "3CC4": 1857,
      "SCCS1": 1858,
      "2CCCN": 1859,
      "nc2Cl": 1860,
      "nc2n": 1861,
      "n2ncc3": 1862,
      "c2cs": 1863,
      "CNCc1ccc": 1864,
      "Cc1cccc2c": 1865,
      "1CC1": 1866,
      "COc1ccnc": 1867,
      "c1ncno1": 1868,
      "4C3": 1869,
      "CCc1ccc2c": 1870,
      "NC1CCNCC1": 1871,
      "c4n3": 1872,
      "CNCCN": 1873,
      "Nc1nc2cc": 1874,
      "CC1CCOCC1": 1875,
      "cnn2": 1876,
      "c1onc": 1877,
      "c1cc2cccc": 1878,
      "c1nnc2ccc": 1879,
      "C4CCN": 1880,
      "cccC": 1881,
      "C1CCCCCC1": 1882,
      "CCc1cn": 1883,
      "CCCOS": 1884,
      "Cc1ccccc1I": 1885,
      "NN1C": 1886,
      "c2c1OC": 1887,
      "COCc1cc": 1888,
      "N1I": 1889,
      "c1cc2ncc": 1890,
      "CCC1CCCCC1": 1891,
      "OBOC1": 1892,
      "NCCN2": 1893,
      "CCCN1": 1894,
      "c6c": 1895,
      "COc2cccc": 1896,
      "n4c": 1897,
      "CCCCCCCCOc1ccc": 1898,
      "CCCC1C": 1899,
      "c4cn": 1900,
      "c3cccc4ccccc34": 1901,
      "COc1ccc2c3c1O": 1902,
      "c3ccccc3N": 1903,
      "N5CCN": 1904,
      "CCCCCCCCc1ccc": 1905,
      "Nc1ccccc1Cl": 1906,
      "c4n": 1907,
      "BrCc1ccc": 1908,
      "cc1ncnc1n": 1909,
      "COc1ccc2ncc": 1910,
      "Cc2ncc": 1911,
      "c43": 1912,
      "cc1cn": 1913,
      "ccI": 1914,
      "c3ncccc23": 1915,
      "c2cc3ccc": 1916,
      "c1cscn1": 1917,
      "2c2ccccc2": 1918,
      "cnc23": 1919,
      "COCCl": 1920,
      "c4nnc": 1921,
      "ccc1I": 1922,
      "CCCCCCCCN": 1923,
      "c2ccc3ccc": 1924,
      "c2cc1C": 1925,
      "Cc1ccccc1OC": 1926,
      "Cn1ccc2cc": 1927,
      "cc3ccccc23": 1928,
      "n3ncc": 1929,
      "C1S": 1930,
      "Oc2ccc3nc": 1931,
      "N1N": 1932,
      "1SC": 1933,
      "1F": 1934,
      "nc4ccc": 1935,
      "no3": 1936,
      "NNS": 1937,
      "sc21": 1938,
      "C1c1cccc": 1939,
      "COc1cn": 1940,
      "c2ncccc21": 1941,
      "2CC2": 1942,
      "NC12CC3CC": 1943,
      "OC3CCCCO3": 1944,
      "ClC1": 1945,
      "AlH": 1946,
      "C5CC5": 1947,
      "CCCN1CCC": 1948,
      "1CS": 1949,
      "CCc1n": 1950,
      "CCOc1nc": 1951,
      "CCOc1ccc2c": 1952,
      "scn1": 1953,
      "NC2C": 1954,
      "c1nccn1": 1955,
      "OCc3c": 1956,
      "CO4": 1957,
      "cc1OC1CCCC1": 1958,
      "N1Cc1ccc": 1959,
      "c3cc4ccccc4": 1960,
      "-])/": 1961,
      "cc1OCCC": 1962,
      "CN2CCNCC2": 1963,
      "]%": 1964,
      "NCCO1": 1965,
      "CC12CCC": 1966,
      "n2S": 1967,
      "CC3CCC": 1968,
      "C1CCc2c": 1969,
      "CCNc1nc": 1970,
      "NC2CCOCC2": 1971,
      "C3CCOCC3": 1972,
      "c2cccnc12": 1973,
      "1COc2cc": 1974,
      "c1CBr": 1975,
      "2ccccc2": 1976,
      "C1CN2": 1977,
      "24": 1978,
      "cnc2n1": 1979,
      "CS2": 1980,
      "c1c2cc": 1981,
      "Cn1nccc1": 1982,
      "ccnc2c1": 1983,
      "CCOCCl": 1984,
      "CSc1n": 1985,
      "cn1C": 1986,
      "c3ccc4ccccc4c3": 1987,
      "n1cncn1": 1988,
      "Sc2cc": 1989,
      "CCN4": 1990,
      "NNc1ccccc1": 1991,
      "NCc2cccc": 1992,
      "NOCC": 1993,
      "Cc4cccc": 1994,
      "c4ccnc": 1995,
      "Nc1ncc2c": 1996,
      "Cn3c": 1997,
      "CCN1CCNCC1": 1998,
      "OC5": 1999,
      "CCCCO4": 2000,
      "1COCCN1": 2001,
      "cc1C1": 2002,
      "c2cc3nc": 2003,
      "O5": 2004,
      "cc3cc": 2005,
      "Brc1ccc2": 2006,
      "N5CCOCC5": 2007,
      "Cc2cn": 2008,
      "NCC1CCN": 2009,
      "c3ccsc3": 2010,
      "OC2C": 2011,
      "nc2c1ncn2": 2012,
      "SCc1ccccc1": 2013,
      "ccc2nc": 2014,
      "Nc4ccccc4": 2015,
      "C1CCO": 2016,
      "c3c1": 2017,
      "c1ccc2ccccc2n1": 2018,
      "Cc5ccccc5": 2019,
      "Nc1ccnc": 2020,
      "1CCCNC1": 2021,
      "1Br": 2022,
      "Cc1nc2ccccc2": 2023,
      "CCN1CC2": 2024,
      "2c2ccc": 2025,
      "C2c3ccccc3": 2026,
      "N4CCCC4": 2027,
      "C1Br": 2028,
      "ccc31": 2029,
      "cc1n": 2030,
      "NOC1CCCCO1": 2031,
      "1c2ccccc2C": 2032,
      "Nc3ccc4c": 2033,
      "n2cccc2": 2034,
      "OCC2CO2": 2035,
      "cc2CC1": 2036,
      "c1cc2nc": 2037,
      "c1CNC": 2038,
      "OCc2nc": 2039,
      "OCCO5": 2040,
      "CCCN3C": 2041,
      "CC1CC2": 2042,
      "1Cc2ccccc2": 2043,
      "OCCCCO": 2044,
      "c1nc2ccccc2n1": 2045,
      "c1ccnn1": 2046,
      "co2": 2047,
      "ccc2c1O": 2048,
      "CC1CCC1": 2049,
      "Oc1ccc2cc": 2050,
      "n2c3c": 2051,
      "ncc1Br": 2052,
      "n1nnc2ccccc21": 2053,
      "Clc1n": 2054,
      "CCSc1ccc": 2055,
      "NCC1CC1": 2056,
      "OCOCC": 2057,
      "nnc1": 2058,
      "CN1CCCC": 2059,
      "Nc1nc2ccccc2": 2060,
      "1CCO": 2061,
      "CNCCC": 2062,
      "C23": 2063,
      "CCCCOCCOc1ccc": 2064,
      "CCc1nn": 2065,
      "c1cccc2nc": 2066,
      "NCCC2": 2067,
      "ncc23": 2068,
      "IC1": 2069,
      "NCCOCCO": 2070,
      "ncc21": 2071,
      "OCCC1": 2072,
      "CN3CCOCC3": 2073,
      "CNc1c": 2074,
      "OC12": 2075,
      "n2Cc2ccccc2": 2076,
      "CCCCCCCCCCCCCCCCC": 2077,
      "C1CC2C": 2078,
      "OCC4CC4": 2079,
      "cc1cccc": 2080,
      "Nc1ncccn1": 2081,
      "1Cl": 2082,
      "ccc3o2": 2083,
      "CCCCCCCN": 2084,
      "ns1": 2085,
      "cc4Cl": 2086,
      "cccO": 2087,
      "2CC1": 2088,
      "BrP": 2089,
      "C1COCCOCCOCCOCCO": 2090,
      "Cc1cnc2c": 2091,
      "nnn2O": 2092,
      "occ": 2093,
      "sc2ccccc12": 2094,
      "cccn": 2095,
      "c2CC1": 2096,
      "sc2C": 2097,
      "COCCOc1ccc": 2098,
      "noc2C": 2099,
      "CCCCc1ccccc1": 2100,
      "CSc1nccc": 2101,
      "COc1ccccc1N1CCN": 2102,
      "CCCCCOC": 2103,
      "C1c2c": 2104,
      "NOCc1ccccc1": 2105,
      "c2nc3ccccc3o2": 2106,
      "c2ncccc2C": 2107,
      "COCCNC": 2108,
      "n1CC": 2109,
      "N1c2ccccc2": 2110,
      "BrCCBr": 2111,
      "SI": 2112,
      "CC1CCNCC1": 2113,
      "n21": 2114,
      "CN5": 2115,
      "CSc": 2116,
      "c2cc3nccc": 2117,
      "C2SC": 2118,
      "CCN3CCC": 2119,
      "COc1cncc": 2120,
      "cnn2CC": 2121,
      "OCCCO2": 2122,
      "OCCOCCOCCO": 2123,
      "cc1cC": 2124,
      "C1c2cc": 2125,
      "NCc1cccnc1": 2126,
      "oc3cc": 2127,
      "3N": 2128,
      "c9": 2129,
      "CCO4": 2130,
      "Cc2cccnc2": 2131,
      "nc4ccccc4": 2132,
      "C1Nc2cc": 2133,
      "c2ncnn12": 2134,
      "4CCCC": 2135,
      "C1I": 2136,
      "C3CCC3": 2137,
      "P12": 2138,
      "BrC1": 2139,
      "NCCc2ccc": 2140,
      "Sc3ccccc3": 2141,
      "c2cncnc2": 2142,
      "ccc3Cl": 2143,
      "OCCOCCO": 2144,
      "c1nc2cn": 2145,
      "Cn2ccnc2": 2146,
      "CB1OC": 2147,
      "cccnc12": 2148,
      "NC3CCCCC3": 2149,
      "COC1CCC": 2150,
      "c2n1C": 2151,
      "COCOc1cc": 2152,
      "c1sc2c": 2153,
      "2c3ccccc3": 2154,
      "n4ccc": 2155,
      "c2ncccc2": 2156,
      "COC4": 2157,
      "C1Cc2c": 2158,
      "OC2CCCC2": 2159,
      "COc1ccccc1N": 2160,
      "n4cnc": 2161,
      "c2nc3ccccc3s2": 2162,
      "n1cccn1": 2163,
      "c2nnnn2C": 2164,
      "c2ccccc23": 2165,
      "Cc1ccccc1B": 2166,
      "C1CN1": 2167,
      "CNc2cc": 2168,
      "cc13": 2169,
      "OCC1C": 2170,
      "Oc2ccccc21": 2171,
      "SCCCS2": 2172,
      "3ccccc3": 2173,
      "1CCc2cc": 2174,
      "C1SCCCS1": 2175,
      "NCCN1": 2176,
      "CCCNC1": 2177,
      "C23CC4CC": 2178,
      "c1ccc2c3c": 2179,
      "cc2ccccc21": 2180,
      "CNc": 2181,
      "COc1cc3c": 2182,
      "CC1c1ccc": 2183,
      "CCN1c1ccc": 2184,
      "CNCCNC": 2185,
      "cNN": 2186,
      "Nc1ccc2nc": 2187,
      "n4C": 2188,
      "CNCC3": 2189,
      "C1Cc2ccccc2C1": 2190,
      "NCS": 2191,
      "N2CCCN": 2192,
      "SCc2ccccc2": 2193,
      "CCCCCN1C": 2194,
      "OCCF": 2195,
      "Cc1ccccc1NC": 2196,
      "c1cc2ccccc2o1": 2197,
      "CCOCn1cc": 2198,
      "Oc3ccnc": 2199,
      "noc1": 2200,
      "CC2CCC": 2201,
      "ccc1Oc1ccc": 2202,
      "CCCCc1c": 2203,
      "c5ccccc54": 2204,
      "c2c1CCCC2": 2205,
      "cn2c1": 2206,
      "Nc1ncnc": 2207,
      "nn3c": 2208,
      "NCCN1CCOCC1": 2209,
      "COCCCOc1cc": 2210,
      "N2CCS": 2211,
      "c4cncc": 2212,
      "c1ncn": 2213,
      "CCc1": 2214,
      "cc2n": 2215,
      "NC5": 2216,
      "CCS1": 2217,
      "c1Nc1ccc": 2218,
      "Brc1ccccn1": 2219,
      "1N2C": 2220,
      "c3ncccn3": 2221,
      "C1c2ccc": 2222,
      "CCCOc1cccc": 2223,
      "Nc1ccccc1S": 2224,
      "c13": 2225,
      "CN3CCC": 2226,
      "CCC2C": 2227,
      "Oc2ccnc3cc": 2228,
      "C1CCc2ccc": 2229,
      "ClCC1CO1": 2230,
      "Nc3ccc4": 2231,
      "c1ccc2sc": 2232,
      "c2nc3n": 2233,
      "cccI": 2234,
      "c2cn1": 2235,
      "cc1ncoc1c": 2236,
      "ncc1F": 2237,
      "Nc1ccccc1F": 2238,
      "n2Cc1ccccc1": 2239,
      "c1cccc2c1C": 2240,
      "CCCc2ccccc2": 2241,
      "N3CC4": 2242,
      "nnc2c1": 2243,
      "CNc1cccc": 2244,
      "CCCCCC2": 2245,
      "COCCBr": 2246,
      "4CC5CC": 2247,
      "Oc3c": 2248,
      "NC1CN": 2249,
      "c1sccc1": 2250,
      "cc1B": 2251,
      "Cc1ccccc1P": 2252,
      "CCCCCCOc1ccc": 2253,
      "OCc4ccc": 2254,
      "c1cnn2c": 2255,
      "noc2c1": 2256,
      "CCCCOc1nc": 2257,
      "cccN": 2258,
      "n2Cc2ccc": 2259,
      "NCCCNC": 2260,
      "Nc1ccccc1O": 2261,
      "c1cn2cc": 2262,
      "CCC5": 2263,
      "CC12CC3CC": 2264,
      "CC1N": 2265,
      "cn23": 2266,
      "C1Nc2ccccc2": 2267,
      "sc3c": 2268,
      "NCc2cc": 2269,
      "ClCCCBr": 2270,
      "Cc2ccccc2F": 2271,
      "Nc1ccnn1": 2272,
      "Nc1ccccc1Br": 2273,
      "OCc3cccc": 2274,
      "n2n": 2275,
      "CCOc1cc2c": 2276,
      "C2CO2": 2277,
      "c1nc2cccc": 2278,
      "CCC1O": 2279,
      "ncc2F": 2280,
      "c1CN": 2281,
      "ncccc2c1": 2282,
      "Nc3ccccc32": 2283,
      "COC2CCCCO2": 2284,
      "CCC1CCC": 2285,
      "c3ccccc3O": 2286,
      "Cn1nnc": 2287,
      "ncs": 2288,
      "n2cncn2": 2289,
      "C2NC": 2290,
      "Nc3ncnc4": 2291,
      "2CC3": 2292,
      "Nc2ccc3": 2293,
      "CSSC": 2294,
      "CNCc1ccccc1": 2295,
      "34C": 2296,
      "13C": 2297,
      "cnn1C": 2298,
      "2CN1C": 2299,
      "NCc1ccc2c": 2300,
      "c2ncccc2c1": 2301,
      "NC1CCOCC1": 2302,
